Lab | Data Structuring and Combining Data
Objective:

Combine and integrate data from multiple sources using merging, concatenating, or joining techniques to generate more comprehensive and meaningful datasets for analysis.
Modify the structure of data by pivoting, stacking/unstacking, or melting dataframes, enabling them to efficiently explore and analyze complex datasets.
Challenge 1: Combining Data
In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv
But this time, we got new data, which can be found in the following 2 CSV files located at the following links:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv
Perform data cleaning and formatting using the main cleaning and formatting function created in the previous lab to clean and format the data.

Combine the data from the three dataframes into a single dataframe, named "customer_data", using appropriate merging, concatenating, and joining techniques.

Verify that the customer_data dataframe contains all the rows and columns from the three original dataframes.

Observation:

One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")
df3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [3]:
df1= df1.rename(columns=str.lower)
df2= df2.rename(columns=str.lower)
df3= df3.rename(columns=str.lower)

In [4]:
def rename_columns(df3):
    df3.rename (columns = {'state':'st'}, inplace=True)
    return df3

In [5]:
df3 = rename_columns(df3)

In [6]:
combined_df = pd.concat([df1, df2, df3], axis=0)

In [7]:
combined_df = combined_df.reset_index(drop=True)

In [8]:
combined_df = combined_df.reset_index(drop=True)

In [9]:
combined_df

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
12070,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
12071,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
12072,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
12073,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

In [10]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.0+ MB

In [11]:
combined_df['customer lifetime value']= combined_df ['customer lifetime value'].str.replace("%", " ")

In [12]:
#combined_df['number of open complaints']= combined_df['number of open complaints'].str[2]

In [13]:
combined_df ['customer lifetime value']= combined_df ['customer lifetime value'].astype("float64")

In [14]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    2060 non-null   float64
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(4), object(7)
memory usage: 1.0+ MB

In [15]:
combined_df.gender.unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [16]:
combined_df['gender'] = combined_df['gender'].replace(['F', 'Femal', 'female'], 'female')
combined_df['gender'] = combined_df['gender'].replace(['M', 'Male'], 'male')

In [17]:
combined_df.gender.unique()

array([nan, 'female', 'male'], dtype=object)

In [18]:
combined_df.gender.unique()

array([nan, 'female', 'male'], dtype=object)

In [19]:
combined_df.isna().sum()

customer                      2937
st                            2937
gender                        3059
education                     2937
customer lifetime value      10014
income                        2937
monthly premium auto          2937
number of open complaints     2937
policy type                   2937
vehicle class                 2937
total claim amount            2937
dtype: int64

In [20]:
nulls_combined_df = pd.DataFrame(round(combined_df.isna().sum()/len(combined_df),4)*100)
nulls_combined_df = nulls_combined_df.reset_index()
nulls_combined_df.columns = ['header_name', 'percent_nulls']
nulls_combined_df

                  header_name  percent_nulls
0                    customer          24.32
1                          st          24.32
2                      gender          25.34
3                   education          24.32
4     customer lifetime value          82.94
5                      income          24.32
6        monthly premium auto          24.32
7   number of open complaints          24.32
8                 policy type          24.32
9               vehicle class          24.32
10         total claim amount          24.32

In [21]:
combined_df = combined_df.dropna(subset = "customer")

In [22]:
combined_df = combined_df.reset_index(drop=True)

In [23]:
combined_df.isna().sum()

customer                        0
st                              0
gender                        122
education                       0
customer lifetime value      7077
income                          0
monthly premium auto            0
number of open complaints       0
policy type                     0
vehicle class                   0
total claim amount              0
dtype: int64

In [24]:
mode_value = combined_df['gender'].mode()[0]

In [25]:
combined_df['gender'].fillna(mode_value, inplace=True)

In [26]:
combined_df.isna().sum()

customer                        0
st                              0
gender                          0
education                       0
customer lifetime value      7077
income                          0
monthly premium auto            0
number of open complaints       0
policy type                     0
vehicle class                   0
total claim amount              0
dtype: int64

In [27]:
mean_value = combined_df['customer lifetime value'].mean()

In [28]:
combined_df['customer lifetime value'].fillna(mean_value, inplace=True)

In [29]:
combined_df.isna().sum()

customer                     0
st                           0
gender                       0
education                    0
customer lifetime value      0
income                       0
monthly premium auto         0
number of open complaints    0
policy type                  0
vehicle class                0
total claim amount           0
dtype: int64